backend/load/artillery.yml
# Artillery v2 load-test scenario for the funding-finder backend.
#
# Goal: prove the API (a) sustains a normal request rate WITHOUT tripping its
# own rate limiter (no 429s during steady load) and (b) throttles an abusive
# spike (429s appear only when the limiter is intentionally overwhelmed).
#
# Prerequisites — the backend must be running and reachable:
#     npm run dev            # or: node dist/index.js
#
# Run:
#     npx artillery run load/artillery.yml
#     npx artillery run --target http://localhost:8080 load/artillery.yml
#     TARGET=http://staging.example.com npx artillery run load/artillery.yml
#
# Notes:
#   - Public endpoints are used (no auth token needed) so the scenario is
#     self-contained. Authenticated routes are intentionally excluded — the
#     steady/abuse assertions below are about the global ingress limiter, not
#     per-user quotas.
#   - `ensure.maxErrorRate` is intentionally high: we MEASURE error/429 rates
#     rather than aborting, so you can read them off the report.

config:
  target: "{{ $processEnvironment.TARGET || 'http://localhost:3000' }}"
  ensure:
    # We do NOT want Artillery to fail the run on 429s — that is the signal we
    # are measuring. Keep this high and read the per-endpoint counters instead.
    maxErrorRate: 100
  # Capture the rate-limit headers so we can assert behaviour from the report.
  http:
    followRedirects: false
  phases:
    # Phase 1 — steady, realistic load. Expectation: ~0% 429 / 5xx.
    - duration: 30
      arrivalRate: 20          # 20 new virtual users / second
      name: "Steady baseline load"
    # Phase 2 — aggressive spike to overwhelm the global limiter. Expectation:
    # a meaningful fraction of requests get 429 (the server protects itself
    # and the upstream exchange APIs from a rate-limit storm).
    - duration: 20
      arrivalRate: 20
      rampTo: 400              # ramp up to 400 VUs/s
      name: "Stress spike (rate-limit abuse)"
  defaults:
    headers:
      accept: "application/json"
      content-type: "application/json"

scenarios:
  - name: "Health + feature flags + metrics (public read endpoints)"
    weight: 1
    flow:
      - get:
          url: "/api/health"
          name: "GET /api/health"
          capture:
            - json: "$.ok"
              as: "ok"
      - get:
          url: "/api/feature-flags"
          name: "GET /api/feature-flags"
      - get:
          url: "/api/prometheus"
          name: "GET /api/prometheus"
      - get:
          url: "/api/ready"
          name: "GET /api/ready"